//------------------------------------------------------------------------------
// complex_number.h - содержит описание комплексного числа и его интерфейса
//------------------------------------------------------------------------------
#include <fstream>
#include <stdbool.h>
#include <stdio.h>
#include "rnd.h"

struct complex_number {
    double real , imaginary ;
};

//------------------------------------------------------------------------------
// Ввод параметров комплексного числа из потока
void c_In(complex_number &c, ifstream &ifst);

//------------------------------------------------------------------------------
// Случайный ввод параметров комплексного числа
void InRnd(complex_number &c);

//------------------------------------------------------------------------------
// Вычисление значения комплексного числа
double complex_calculation(complex_number &c);

//------------------------------------------------------------------------------
// Вывод параметров комплексного числа в файл
void c_Out(complex_number &c, ofstream &ofst);

